[
  {
    "art_id": "mxkE8nZpMBkJF83Iw01s",
    "title": "Crimson Core",
    "artist": "Gala",
    "price": 5800.0,
    "slug": "crimson-core",
    "main_image": "https://bayagallery.com/cdn/land/main.webp",
    "search_blob": "Crimson Core Gala Abstract Art Crimson Core is a visceral abstraction that captures the fiery depth of the earth’s inner layers. Gala sculpts her surface with textured pigments of deep rust, ember-red, and glimmers of gold-revealing a world beneath the visible. The composition evokes volcanic terrain, ancient minerals, and the slow burn of transformation. This is not just a painting - it’s an excavation of memory and matter, where what’s buried pulses with life. The thick, tactile surface invites viewers into a raw yet poetic meditation on nature’s power, resilience, and hidden beauty. Mixed Media on Canvas 70.9x63 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "vmZFdunmlQlJ02MLsvwa",
    "title": "Bograshov Beach",
    "artist": "Merav Salman",
    "price": 5700.0,
    "slug": "bograshov-beach",
    "main_image": "https://bayagallery.com/cdn/tlv/tlv.webp",
    "search_blob": "Bograshov Beach Merav Salman Modern Portraits A tribute to Tel Aviv’s vibrant coastline, Bograshov Beach captures the pulse of Israeli urban life through a striking interplay of movement, color, and emotion. Merav Salman channels her signature visual storytelling into this powerful piece, depicting two kitesurfers dancing over waves that blur the lines between chaos and control. The brushwork is expressive, the water almost sculptural — a physical memory of the sea. While at first glance the scene may evoke thrill and leisure, there’s an undercurrent of emotional tension. Like much of Salman's work, this painting balances energy and introspection — the sea becoming a metaphor for resilience, vulnerability, and the perpetual quest for freedom in a crowded world.\nRooted in Tel Aviv yet universally resonant, Bograshov Beach is a contemporary Israeli masterpiece that connects place, motion, and soul. Mixed Media on Canvas 27.6×59.1 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "6jUebx1Zyn4cRUtPFTKS",
    "title": "Last Breath",
    "artist": "Moti Nataf",
    "price": 4700.0,
    "slug": "last-breath",
    "main_image": "https://bayagallery.com/cdn/moti/LastBreath/LastBreath2.jpg",
    "search_blob": "Last Breath Moti Nataf Sculptures Last Breath is a handcrafted wall sculpture depicting the final glimpse of a whale’s tail disappearing beneath the waves. Made from sculpted and treated leather, the piece captures a moment of serene departure – where movement, silence, and memory converge. Rich in maritime symbolism and emotional resonance, this work continues Moti Nataf’s exploration of the sea as both physical space and poetic metaphor. Copper and Patinated Brass 25.6×27.6 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "5c910z0O9wFJvk37j3BQ",
    "title": "Let Go",
    "artist": "Moti Nataf",
    "price": 5600.0,
    "slug": "let-go",
    "main_image": "https://bayagallery.com/cdn/moti/letgo/letgo.jpg",
    "search_blob": "Let Go Moti Nataf Sculptures Let Go is a sculptural wall piece that explores the tension between holding on and letting go – much like watching a ship fade on the horizon. The glossy red balloon, rising from a weathered copper surface with a bronze-like patina, echoes memories of childhood by the sea, where dreams are lifted by the wind, and hands must learn to release.\nIn Let Go, Moti Nataf extends his lifelong dialogue with the sea, this time through the universal language of longing and gentle detachment.\n Mixed Media (Copper, Resin) 39.4×15.7×7.9 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "bBhND12AwDA3htKBYn9D",
    "title": "Anchor",
    "artist": "Moti Nataf",
    "price": 7900.0,
    "slug": "anchor",
    "main_image": "https://bayagallery.com/cdn/moti/Anchor.jpg",
    "search_blob": "Anchor Moti Nataf Sculptures Anchor by Moti Nataf is more than an object – it is a symbol of tension between weight and surrender, purpose and pause. Crafted from a 45-year-old ship’s anchor, salvaged from the depths of the sea, and paired with a heavy iron chain, the sculpture evokes both maritime function and poetic stillness. Positioned with elegance yet grounded with force, the anchor becomes a metaphor for holding, remembering, and belonging. Nataf – known for his deep connection to the sea and for working with reclaimed materials from the Jaffa coast – brings emotional precision and sculptural clarity to this piece. Whether viewed as a relic, a tool, or a monument to inner stillness, Anchor invites contemplation on stability in an ever-shifting world.\n\n Weathered iron (Original ship anchor & Chain) 39.4×19.7 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "rFUYbvq0wyFhILBDybWr",
    "title": "Whispering Growth",
    "artist": "Voidstate",
    "price": 2750.0,
    "slug": "whispering-growth",
    "main_image": "https://bayagallery.com/cdn/ai/bloom/main.png",
    "search_blob": "Whispering Growth Voidstate AI Art Whispering Growth portrays a quiet yet powerful metamorphosis. The figure - a feminine form emerging from textured bark - stands poised with grace, her face replaced by a single blooming lily. Rooted in organic lines and subtle curvature, this being embodies both vulnerability and resilience. Against a deep green backdrop, her stillness whispers of silent evolution, inner blooming, and the symbiosis of nature and identity.\nThis artwork invites contemplation of life, femininity, and growth in the age of generative consciousness. Generative pigment print 35.4×23.6 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included, Includes immersive digital animation"
  },
  {
    "art_id": "vGDTKrDjRdRs6Fqaelbs",
    "title": "Becoming Root",
    "artist": "Voidstate",
    "price": 2800.0,
    "slug": "becoming-root",
    "main_image": "https://bayagallery.com/cdn/ai/root/main.png",
    "search_blob": "Becoming Root Voidstate AI Art Becoming Root portrays a mythic moment of transformation - a human figure merging with nature, its body carved from bark, its limbs outstretched in eternal embrace, and its crown blossoming into a vibrant canopy. Roots descend from its feet like veins of the earth, symbolizing ancestral memory and spiritual grounding. Rendered in earthy golden hues, this piece evokes a state of suspended ascension: timeless, still, and alive. It is both a portrait of strength and surrender - where identity dissolves into the natural world. Generative pigment print 47.2×31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included, Includes immersive digital animation"
  },
  {
    "art_id": "UwUczmGSQaFkfFjdDwzZ",
    "title": "Majestic Strength",
    "artist": "Gala",
    "price": 5250.0,
    "slug": "majestic-strength",
    "main_image": "https://bayagallery.com/cdn/pil/main.jpeg",
    "search_blob": "Majestic Strength Gala Modern Portraits A powerful depiction of an elephant rendered in vivid blues, golds, and blacks, \"Majestic Strength\" captures the grandeur and emotional depth of one of nature’s most iconic creatures. The expressive brushwork and bold palette invite the viewer into a dynamic conversation between color and form. This striking piece embodies contemporary figurative art with a wild spirit and elegant execution.\n Mixed Media on Canvas 39.4x51.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "4JpQODIQZmasRs3aWgSA",
    "title": "Cherry Lips",
    "artist": "Gala",
    "price": 4700.0,
    "slug": "cherry-lips",
    "main_image": "https://bayagallery.com/cdn/lips/main.jpeg",
    "search_blob": "Cherry Lips Gala Modern Portraits Cherry Lips is a bold and captivating pop-art style piece that immediately draws the eye. With a vibrant cyan blue background, glossy purple lips, and two juicy red cherries, the composition delivers a playful, provocative, and iconic image that feels both modern and timeless. The clean lines, flat colors, and exaggerated features are reminiscent of comic-book influences and commercial aesthetics, making this piece perfect for collectors of contemporary pop and figurative art.\nThe confident use of color and minimalistic yet expressive design speak to themes of sensuality, femininity, and visual boldness. This work makes a statement in any space, whether in a trendy urban loft, modern gallery, or stylish private home.  Acrylic on Canvas 43.3x51.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "IEm8V3lEjf9eoSN0qmd1",
    "title": "Chromatic Rain",
    "artist": "Gala",
    "price": 6200.0,
    "slug": "chromatic-rain",
    "main_image": "https://bayagallery.com/cdn/abs/main.jpeg",
    "search_blob": "Chromatic Rain Gala Abstract Art Chromatic Rain is an expressive abstract work bursting with unapologetic color and emotion. Bold drips of vibrant paint cascade vertically across the canvas in layers of orange, pink, cobalt blue, yellow, and black-each telling its own energetic story. The composition feels spontaneous yet intentional, with deep textures and overlapping forms that evoke a sense of movement and freedom.\n\n Mixed Media on Canvas 35.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "k0DG4xMLYsmFaD3B9JC3",
    "title": "Blue Leaf Whisper",
    "artist": "Gala",
    "price": 4700.0,
    "slug": "blue-leaf-whisper",
    "main_image": "https://bayagallery.com/cdn/Leaf/main.jpeg",
    "search_blob": "Blue Leaf Whisper Gala Modern Portraits Blue Leaf Whisper is a striking figurative portrait crafted with mixed media, blending illustration, painting, and texture in perfect harmony. The subject—a woman with deep black flowing hair and bold red lips-exudes quiet confidence and mystery. Her upward gaze and exposed neckline create a feeling of openness and strength, while the delicate blue botanical detail in the corner adds a whisper of softness and contrast.\n\n Acrylic on Canvas 27.6x31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "FZFLwNFmmOouJDKL5FQk",
    "title": "Indigo Silence",
    "artist": "Gala",
    "price": 4700.0,
    "slug": "indigo-silence",
    "main_image": "https://bayagallery.com/cdn/Indigo/main.jpeg",
    "search_blob": "Indigo Silence Gala Modern Portraits Indigo Silence is a striking modern portrait capturing a moment of quiet confidence and inner intensity. With her eyes concealed behind a heavy fringe and bold red lips anchoring the composition, the woman depicted is both mysterious and magnetic. The beige background and clean lines allow the rich black of her hair and the deep indigo straps to pop with elegance. This piece speaks of identity, femininity, and strength - rendered in Gala’s unmistakable contemporary voice.\n\n Acrylic on Canvas 27.6x31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "gbYNFBodRGned8NzGuNI",
    "title": "Chromatic Storm",
    "artist": "Gala",
    "price": 7300.0,
    "slug": "chromatic-storm",
    "main_image": "https://bayagallery.com/cdn/Chromatic/image2.jpeg",
    "search_blob": "Chromatic Storm Gala Abstract Art Chromatic Storm unleashes a kaleidoscopic whirlwind of raw energy and emotional movement. Bursts of fuchsia, electric blue, yellow and gold clash and merge in a textured surface that feels alive. Gala’s brushwork is both instinctual and deliberate - a spontaneous dance between chaos and control. The splattered layers and fluid motion express a moment of explosion frozen in time. This bold work is a declaration of creative freedom, ideal for collectors seeking maximalist, expressive power on canvas. Mixed Media on Canvas 70.9x63 in 2025.0 Sold Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "0OHsv8QgzCZGI7vca6Is",
    "title": "Electric Motion",
    "artist": "Gala",
    "price": 7300.0,
    "slug": "electric-motion",
    "main_image": "https://bayagallery.com/cdn/Electric/main.jpeg",
    "search_blob": "Electric Motion Gala Abstract Art Electric Motion is a vibrant abstract explosion of kinetic energy. With vivid electric blues, blazing pinks, and piercing neon yellows, Gala orchestrates a storm of movement across the canvas. The piece pulses with intensity - layers of thick texture and sweeping lines create a sense of continuous motion. It's both chaotic and harmonious, revealing the artist's fearless dialogue with emotion and color. This work is a celebration of raw expression and material mastery. Mixed Media on Canvas 63x47.2 in 2025.0 Sold Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "KC7DE2xgcfMU0pTinLKD",
    "title": "Cosmic Pulse",
    "artist": "Gala",
    "price": 5700.0,
    "slug": "cosmic-pulse",
    "main_image": "https://bayagallery.com/cdn/Cosmic/image.jpeg",
    "search_blob": "Cosmic Pulse Gala Abstract Art Cosmic Pulse is a vibrant abstract composition that radiates energy, movement, and emotion. Explosions of neon pink, cobalt blue, electric yellow and textured circular patterns create a visual rhythm reminiscent of cosmic waves or inner vibrations. Rich layers of paint and tactile ridges invite the viewer to experience color not just visually, but physically. This piece exemplifies Gala’s fearless approach to material and color, making it a bold statement for any modern space. Mixed Media on Canvas 31.5x78.7 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "C1LupXwz9SnIH6932zne",
    "title": " Soul In Bloom",
    "artist": "Gala",
    "price": 7700.0,
    "slug": "soul-in-bloom",
    "main_image": "https://bayagallery.com/cdn/soul/image.png",
    "search_blob": " Soul In Bloom Gala Modern Portraits Soul In Bloom is a stunning mixed media portrait that captures the delicate strength of the feminine spirit. With eyes gently closed and posture serene, the figure appears to emerge from a radiant storm of color - a visual metaphor for inner peace amidst chaos. The composition bridges classical portraiture and abstract expression, as Gala weaves bold splashes of electric blue, warm gold, and fuchsia into an emotionally charged celebration of self. This piece exemplifies Gala's signature style: striking, soulful, and unforgettable. Mixed Media on Canvas 86.6x55.1 in 2025.0 Sold Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "yxjDojqIlR8vUTMscuGX",
    "title": "Bronze Lighthouse",
    "artist": "Moti Nataf",
    "price": 7600.0,
    "slug": "bronze-lighthouse",
    "main_image": "https://bayagallery.com/cdn/moti/migdalor/image.jpg",
    "search_blob": "Bronze Lighthouse Moti Nataf Sculptures This sculptural lighthouse by Moti Nataf stands as a monumental tribute to maritime strength and endurance. Crafted from bronze and solid metal, the tower rises with a dramatic, tapered structure, surrounded by a hand-formed spiral staircase. Its upper lantern is crowned with a sharp, conical cap – a beacon in both form and meaning. The lighthouse is anchored to a natural stone base, giving it a grounded presence that reflects the artist's deep connection to coastal landscapes and the sea. The use of bronze, with its timeless patina, lends the work a sense of weight, permanence, and historical reverence.\n Bronze with natural stone base 31.5x15.7x15.7 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "iy3dPuhsKLJnHzj4XJgE",
    "title": "Anchor",
    "artist": "Moti Nataf",
    "price": 6900.0,
    "slug": "anchor-2",
    "main_image": "https://bayagallery.com/cdn/moti/scup3/scup1.jpg",
    "search_blob": "Anchor Moti Nataf Sculptures A sculptural anchor reimagined as a tribute to maritime heritage, this unique piece by Moti Nataf fuses raw authenticity with refined craftsmanship. The vertical shaft is made from real wood salvaged from a historic ship, bearing the natural texture and memory of time at sea. The curved base is crafted from three types of marble, meticulously shaped to form a powerful yet elegant foundation. This work explores the symbolic weight of anchors - not only as tools of stability, but as emblems of identity, grounding, and belonging. Moti Nataf's deep connection to the sea is present in every detail, from the wrapped iron ring to the organic curvature of the wood. Mixed Media of Wood and Metal 39.4x19.7x7.9 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included, Authentic ship wood, three types of marble, metal"
  },
  {
    "art_id": "488MDhufMCoSr8id2O6I",
    "title": "Departure",
    "artist": "Moti Nataf",
    "price": 7100.0,
    "slug": "departure",
    "main_image": "https://bayagallery.com/cdn/moti/midalor2/scup1.jpg",
    "search_blob": "Departure Moti Nataf Sculptures A powerful maritime sculpture by Moti Nataf, combining the form of a ship with an elongated mast made of intertwined iron elements - evoking a chain, a ladder, or a bridge to the unknown.\nThis one-of-a-kind piece captures the tension between weight and aspiration, sea and sky, journey and destination. Made entirely of hand-worked wood and metal elements from a ship, it is a poetic statement of strength, resilience, and movement. Mixed Media of Wood and Metal 39.37x15.75x15.75 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included, Authentic ship wood and iron salvaged from real boats"
  },
  {
    "art_id": "nsY0eYCoRR8IMf9mcNAF",
    "title": "The Horizon Keeper",
    "artist": "Moti Nataf",
    "price": 7400.0,
    "slug": "the-horizon-keeper",
    "main_image": "https://bayagallery.com/cdn/moti/midalor/image1.jpg",
    "search_blob": "The Horizon Keeper Moti Nataf Sculptures This one-of-a-kind lighthouse sculpture is a handcrafted creation by Israeli artist Moti Nataf, whose deep connection to the sea shapes every piece he makes.\n\nBuilt from natural stone bricks and aged metal elements, The Horizon Keeper rises with quiet strength - echoing the watchful presence of lighthouses that guard the edge of the world. Inspired by Nataf’s childhood in the Jaffa port, this piece is both personal and universal, embodying a deep maritime spirit and masterful craftsmanship.\n\n Mixed Media on Iron base 39.4x15.7x15.7 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "4Z6SzmPEXUGLBGBpunnR",
    "title": "Earthen Memory",
    "artist": "Gala",
    "price": 5400.0,
    "slug": "earthen-memory",
    "main_image": "https://bayagallery.com/cdn/Earthen/main.png",
    "search_blob": "Earthen Memory Gala Abstract Art “Earthen Memory” is an abstract exploration of texture, time, and the silent presence of the earth itself. Gala works with layered pigments and tactile materials to evoke the impression of ancient surfaces-perhaps rock, perhaps clay, perhaps something remembered rather than seen. The flowing vertical forms suggest geological history, erosion, or remnants of architecture long buried. With a restrained palette of warm browns, greys, and ochres, the piece carries a quiet strength, inviting viewers to reflect on the stories that surfaces can hold. As with all her abstract works, Gala leaves the interpretation open, yet emotionally grounded. Mixed Media on Canvas 35.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "qYtVmHxhC7E2enZLVu3W",
    "title": "Saline Echo",
    "artist": "Gala",
    "price": 5100.0,
    "slug": "saline-echo",
    "main_image": "https://bayagallery.com/cdn/Saline/main.png",
    "search_blob": "Saline Echo Gala Abstract Art “Saline Echo” is a refined abstract composition by Gala, where textured surfaces meet tranquil gradients in an almost meditative dialogue. Subtle hues of pale mineral green blend into soft, chalky whites, evoking natural formations and the gentle shift between solid and liquid. The tactile contrast invites viewers to sense a landscape without defining it-perhaps a shoreline, a salt plain, or a memory suspended in time. With her signature restraint and emotional clarity, Gala allows space for personal interpretation, crafting a visual experience that is both rooted and open, abstract and deeply human. Mixed Media on Canvas 35.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "htRxqM2M25lNwS2sS9Ri",
    "title": "Florentin",
    "artist": "Merav Salman",
    "price": 5700.0,
    "slug": "florentin",
    "main_image": "https://bayagallery.com/cdn/florentin/main.jpeg",
    "search_blob": "Florentin Merav Salman Urban Scenes “Florentin” captures the spirit of one of Tel Aviv’s most eclectic and vibrant neighborhoods. Painted in warm amber tones with expressive brushstrokes, the work evokes a dreamy, almost cinematic urban evening. Shadowy figures walk through abstracted streets surrounded by looming buildings and glowing windows, while a bridge slices through the background—connecting spaces both literally and emotionally. With her signature blend of spontaneity and sensitivity, Merav Salman offers a poetic visual narrative of modern city life, grounded in human connection and everyday movement. Mixed Media on Canvas 39.4x59 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "pRTpUpTSISZedbwtFpQM",
    "title": "Rothschild Boulevard",
    "artist": "Merav Salman",
    "price": 5700.0,
    "slug": "rothschild-boulevard",
    "main_image": "https://bayagallery.com/cdn/rotshild/main.jpeg",
    "search_blob": "Rothschild Boulevard Merav Salman Urban Scenes “Rothschild Boulevard” by Merav Salman captures the dynamic energy of Tel Aviv’s iconic boulevard through bold abstraction and vibrant contrasts. With its towering red structures and deep perspective lines drawing the viewer inward, the painting offers a striking interpretation of urban life. The empty central road evokes both motion and stillness, reflecting the tension between the city's constant activity and moments of solitude. Known for her emotionally rich and colorful style, Salman blends spontaneity with architectural rhythm, creating a vivid tribute to the heart of contemporary Israel. Mixed Media on Canvas 39.4x59 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "aloYMkDdTzXbHSeYiujU",
    "title": "Shaded Serenity",
    "artist": "Merav Salman",
    "price": 4500.0,
    "slug": "shaded-serenity",
    "main_image": "https://bayagallery.com/cdn/Shaded/Shaded1.jpg",
    "search_blob": "Shaded Serenity Merav Salman Modern Portraits Shaded Serenity captures a moment of tranquil introspection through the poised figure of a woman seated cross-legged on a sunlit pier. Cloaked in monochrome tones, her form contrasts beautifully with the turquoise and gold spatters that enliven the canvas. Her oversized black sunhat veils her face, inviting mystery while shielding her in calm. With signature elegance and emotional depth, Merav Salman transforms a simple pose into a visual meditation on presence, protection, and feminine grace. This painting speaks of inner quietude, effortless style, and the subtle power of stillness. Mixed Media on Canvas 47.2×35.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "kI0iA4eNDLmDX4y5HwCq",
    "title": "Weightless Motion",
    "artist": "Merav Salman",
    "price": 4300.0,
    "slug": "weightless-motion",
    "main_image": "https://bayagallery.com/cdn/Motion/image1.jpg",
    "search_blob": "Weightless Motion Merav Salman Abstract Art In Weightless Motion, Merav Salman departs from her signature figurative language to embrace pure abstraction. A cascade of vivid brushstrokes-ranging from deep oceanic blues to flecks of gold and green-floats across a soft gradient sky. The effect is both rhythmic and meditative, as if capturing a moment of suspended energy or a field of airborne petals caught in an invisible current. The painting invites viewers to lose themselves in movement and atmosphere, evoking feelings of freedom, release, and inner calm. A masterful exercise in expressive mark-making, this piece affirms Salman's versatility and emotional range as an artist. Mixed Media on Canvas 39.4×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "wyojD29asKk2T4RoLDEU",
    "title": "Inner Flow",
    "artist": "Gala",
    "price": 4600.0,
    "slug": "inner-flow",
    "main_image": "https://bayagallery.com/cdn/flow/gala1.JPG",
    "search_blob": "Inner Flow Gala Modern Portraits \"Inner Flow\" by Gala presents a powerful visual meditation on emotion and identity. Executed in bold black and white, the work combines abstract linework with a serene female portrait, evoking a sense of both chaos and calm. The figure’s closed eyes and fluid hair patterns suggest an inner journey - where thoughts, dreams, and emotions swirl beyond the surface. A masterful balance between figurative clarity and expressive abstraction, this piece resonates with viewers drawn to elegance, mystery, and modern visual rhythm. Mixed Media on Canvas 39.4x19.7 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "tWadYNePB5goWP27aZSz",
    "title": "Verdant Stride",
    "artist": "Voidstate",
    "price": 2700.0,
    "slug": "verdant-stride",
    "main_image": "https://bayagallery.com/cdn/ai/image7.png",
    "search_blob": "Verdant Stride Voidstate AI Art Verdant Stride presents an ancient forest bathed in golden mist, through which a monumental, humanoid tree figure moves with quiet purpose. Its form, sculpted from twisted bark and crowned with windswept foliage, blends harmoniously with the moss-covered ground beneath. The atmosphere is both serene and primal, a moment suspended between motion and stillness. Light filters softly through the canopy, illuminating the textures of the being and the world it inhabits - a poetic symbol of rootedness, transition, and silent resilience. Generative pigment print 70×40 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included,  Accompanied by exclusive animation"
  },
  {
    "art_id": "ceA598ZKzfuuzTKlFdYe",
    "title": "Flourish",
    "artist": "Voidstate",
    "price": 2850.0,
    "slug": "flourish",
    "main_image": "https://bayagallery.com/cdn/ai/image5.png",
    "search_blob": "Flourish Voidstate AI Art \"Flourish\" captures a moment of quiet transcendence - a feminine figure dissolving seamlessly into the bloom of a delicate flower. The contours of the body flow like carved wood, giving way to soft petals in shades of peach and chartreuse, suspended against a calm teal background. The work is both sensual and serene, evoking themes of transformation, natural elegance, and the silent resilience of growth. Generative pigment print 47.2×31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included,  Accompanied by exclusive animation"
  },
  {
    "art_id": "Phl8RzWx5gDtes7AxiGS",
    "title": "Petal Rest",
    "artist": "Voidstate",
    "price": 2900.0,
    "slug": "petal-rest",
    "main_image": "https://bayagallery.com/cdn/ai/image3.png",
    "search_blob": "Petal Rest Voidstate AI Art Petal Rest evokes serenity and metamorphosis through the gentle presence of a reclining feminine figure, entirely composed of layered rose petals. Nestled upon a lush forest bed of moss and dappled light, her body glows with a golden warmth from the heart, suggesting life force, healing, or spiritual awakening. The surreal blend of floral anatomy and natural environment creates a quiet tension between delicacy and permanence — where the ephemeral becomes eternal. The piece invites stillness, breath, and reflection. Generative pigment print 48×27 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included,  Accompanied by exclusive animation"
  },
  {
    "art_id": "vezR41GoEa2Zfw1UfoNS",
    "title": "Corelight",
    "artist": "Voidstate",
    "price": 3100.0,
    "slug": "corelight",
    "main_image": "https://bayagallery.com/cdn/ai/image1.png",
    "search_blob": "Corelight Voidstate AI Art \"Corelight\" presents a towering humanoid figure emerging from a swamp, its form entirely composed of ancient, cracked bark. A vibrant blue glow pulses from within its chest, illuminating the fog-drenched woods with a spectral energy. Smoke rises softly from its hollowed head, suggesting a spirit long released. The scene resonates with themes of rebirth, inner strength, and the mystical bond between decay and light. This work is a meditation on elemental power—earth, water, and unseen fire—anchored in mythic stillness. Generative pigment print 40×60 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included,  Accompanied by exclusive animation"
  },
  {
    "art_id": "ZptxgLHjMRHoMCdOFuG6",
    "title": "Urban Heart In Black",
    "artist": "Gala",
    "price": 5200.0,
    "slug": "urban-heart-in-black",
    "main_image": "https://bayagallery.com/cdn/black/main.jpg",
    "search_blob": "Urban Heart In Black Gala Urban Scenes \nThis artwork delves deep into the gritty, yet captivating soul of the city. A striking figure with a cigarette stands as the focal point, exuding an air of rebellion and resilience. The stark black and white contrasts of the figure's face against the vibrant splashes of color surrounding it symbolize the tension between individuality and the chaotic energy of urban life. The bold hat and dark sunglasses obscure the figure's identity, suggesting a sense of anonymity and detachment in the modern world. The painting’s raw emotion and abstract expression evoke the heart of the city—sharp, intense, and full of untold stories. Mixed Media on Canvas 39.3x59 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "NxPBoUq9mJdSiFjPJ26w",
    "title": "Red Panther",
    "artist": "Gala",
    "price": 6600.0,
    "slug": "red-panther",
    "main_image": "https://bayagallery.com/cdn/redpanter/image1.jpg",
    "search_blob": "Red Panther Gala Modern Portraits \"Red Panther\" is a striking example of Modern Figurative Art. The painting features the bold profile of a panther, captured in vivid reds and contrasting hues. The piece combines a figurative approach with dynamic patterns and textures, showcasing the panther's form in a powerful and expressive way. The red background enhances the animal's presence, creating a striking visual contrast that immediately draws the viewer’s eye. Mixed Media on Canvas 35.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "qZrUOV9ntgkTC8ggsDUj",
    "title": "Carolina",
    "artist": "Gala",
    "price": 5200.0,
    "slug": "carolina",
    "main_image": "http://bayagallery.com/cdn/carolina/IMG_7638.jpg",
    "search_blob": "Carolina Gala Modern Portraits ‘Carolina’ is a striking example of modern figurative art, where the artist uses bold, contrasting colors and abstract shapes to depict the profile of a woman. The portrait is simplified and stylized, focusing on the expressive power of form and color rather than detailed realism. The piece reflects a fusion of abstraction and figuration, using vibrant hues of red, blue, and orange to evoke emotion and movement within the human form. The use of these colors creates a dynamic sense of energy, highlighting the contours of the face and adding depth and texture to the painting. Mixed Media on Canvas 27.5x35.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "GoxJEBrXNSlhTdeyRWu2",
    "title": "Temper",
    "artist": "Gala",
    "price": 4900.0,
    "slug": "temper",
    "main_image": "https://bayagallery.com/cdn/temper/IMG_7530.jpg",
    "search_blob": "Temper Gala Abstract Art \"Temper\" is an abstract expressionist painting that uses bold, vibrant colors and dynamic shapes to convey raw emotion and energy. The distortion of the human form suggests a focus on emotional depth rather than realistic representation, capturing the intensity of human experience through the medium of color. This piece invites the viewer to connect with its emotional resonance and explore the internal struggles or passions it may represent. Mixed Media on Canvas 35.4x39.3 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "enZRoU4Na0htNQUmVgDS",
    "title": "Green Panther",
    "artist": "Gala",
    "price": 4900.0,
    "slug": "green-panther",
    "main_image": "http://cdn.bayagallery.com/greenpanter/IMG_6680.jpg",
    "search_blob": "Green Panther Gala Modern Portraits \"Green Panther\" A modern figurative piece blending abstraction with a clear representation of a panther. The artwork uses dynamic, flowing shapes and vivid textures to evoke the power, grace, and mystery of the animal. The panther’s form emerges through a fluid interplay of colors and lines, capturing its wild essence while leaving room for personal interpretation and emotional expression. Mixed Media on Canvas 43x51 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "OLYnEBV4iypmhqObpYkB",
    "title": "Green Lady",
    "artist": "Gala",
    "price": 5400.0,
    "slug": "green-lady",
    "main_image": "https://cdn.bayagallery.com/greenlady/0BC8FD75-6F2C-4184-8621-72130C28550B.JPG?auth=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoxLCJsb2NhbGUiOiJlbl9HQiIsInZpZXdNb2RlIjoibGlzdCIsInNpbmdsZUNsaWNrIjpmYWxzZSwicGVybSI6eyJhZG1pbiI6ZmFsc2UsImV4ZWN1dGUiOmZhbHNlLCJjcmVhdGUiOnRydWUsInJlbmFtZSI6dHJ1ZSwibW9kaWZ5Ijp0cnVlLCJkZWxldGUiOnRydWUsInNoYXJlIjpmYWxzZSwiZG93bmxvYWQiOnRydWV9LCJjb21tYW5kcyI6W10sImxvY2tQYXNzd29yZCI6dHJ1ZSwiaGlkZURvdGZpbGVzIjpmYWxzZSwiZGF0ZUZvcm1hdCI6ZmFsc2V9LCJpc3MiOiJGaWxlIEJyb3dzZXIiLCJleHAiOjE3NDkwNjY2OTQsImlhdCI6MTc0OTA1OTQ5NH0.TZliQast8lyrXjhV_DjK3KrK9cxGaD7j22wAL2yFXXo&inline=true&key=1749059556893",
    "search_blob": "Green Lady Gala Urban Scenes \"Green Lady\" is a contemporary piece rooted in urban realism, blending urban life elements with a figurative style. The central figure, painted in a bold green hue, stands out with a sense of vitality and strength. The use of contrasting colors and exaggerated features highlights the figure against an undefined urban backdrop, reflecting the dynamism and intensity of modern city life.\n\nThis artwork captures the essence of urban environments while keeping the focus on the individual, allowing for personal reflection on identity and existence in today's cityscape.\n\n\n\n\n\n  Acrylic on Canvas 39.3x55 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "IBBeRhJW3RCSm3WRmUAT",
    "title": "I Did Gel Polish",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "i-did-gel-polish",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/i-did-gel-polish.jpeg",
    "search_blob": "I Did Gel Polish Merav Salman Modern Portraits This captivating portrait bursts with style and personality, showcasing a confident woman set against a deep black background. Her bright blue eyes and glossy lips radiate self-assurance, while her bold golden hoop earrings and perfectly manicured nails - freshly done in gel polish - add a touch of glamour. The true centerpiece is her magnificent afro, an explosion of color and texture created with layered splatters of paint in every hue, symbolizing creativity, freedom, and fierce individuality. A celebration of beauty, power, and self-expression. Mixed Media on Canvas 39.4×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "dUOyqJGVSCwUhmlr3nBl",
    "title": "Anita",
    "artist": "Merav Salman",
    "price": 4300.0,
    "slug": "anita",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/anita.jpeg",
    "search_blob": "Anita Merav Salman Modern Portraits Anita is a powerful and expressive portrait that blends realism with bold abstraction. The right side of the canvas presents a grayscale, hyper-realistic rendering of a woman's serene face, her gaze calm yet intense. In contrast, the left side bursts into motion with vibrant magenta, white, and red brushstrokes and splatters that fragment her form into raw emotion and energy. The juxtaposition of control and chaos symbolizes inner strength breaking through restraint, capturing the duality of feminine power and vulnerability. This piece evokes emotion and invites reflection, standing as a dramatic centerpiece of modern figurative art.\n Mixed Media on Canvas 39.4×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "TXHy5a1lZfc8mWTt2NJT",
    "title": "Aline",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "aline",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/aline.jpeg",
    "search_blob": "Aline Merav Salman Modern Portraits Aline is a bold and striking portrait that merges monochromatic elegance with touches of subtle color. The subject's confident expression and slightly tilted head convey a sense of attitude and strength. Painted in grayscale, her intense gaze and defined features are complemented by long flowing hair with soft highlights of pink and gold. The abstract gold-toned background adds warmth and texture, enhancing the modern and edgy mood of the artwork. This painting celebrates individuality, confidence, and raw urban beauty.\n\n Mixed Media on Canvas 39.4×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "l6qbtJTTfM2BiaV46zMF",
    "title": "Melany",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "melany",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/melany.jpeg",
    "search_blob": "Melany Merav Salman Modern Portraits Melany is a vivid, expressive portrait that commands attention with its bold colors and magnetic gaze. Her piercing turquoise eyes shimmer with curiosity and strength, peeking out above oversized round sunglasses that reflect the universe within. The artist uses a vibrant palette of reds, blues, and skin tones, blending realism with a dreamlike quality. Her lips are painted in deep shades of crimson, emphasizing both confidence and mystery. This piece celebrates individuality, bold femininity, and the power of visual storytelling through color and emotion.\n\n Mixed Media on Canvas 31.5×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "lWcNJWKM88SAzqg60vHk",
    "title": "Dreaming In Gold",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "dreaming-in-gold",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/dreaming-of-gold.jpeg",
    "search_blob": "Dreaming In Gold Merav Salman Modern Portraits This captivating painting portrays a woman immersed in a dreamlike state, her face rendered in expressive grayscale tones, with her eyes closed behind oversized glasses. Her voluminous hair is adorned with delicate white flowers, evoking a sense of peace and introspection. Striking gold leaf details cascade down the canvas, adding a luxurious contrast and a touch of surreal elegance. The golden accents seem to blend fantasy and reality, suggesting that her dreams shimmer with beauty and opulence. Mixed Media on Canvas 47.2×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "wxi3VF2oQIqIrmN27f01",
    "title": "Look At Me",
    "artist": "Merav Salman",
    "price": 5100.0,
    "slug": "look-at-me",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-21-scaled.webp",
    "search_blob": "Look At Me Merav Salman Modern Portraits This captivating portrait captures a powerful and confident woman gazing directly at the viewer with striking intensity. Her grayscale figure stands in dramatic contrast against a vivid red and orange abstract background, which bursts with splashes of pink, orange, and yellow, symbolizing energy, passion, and self-expression. The bold brushstrokes and expressive color palette highlight her strength and individuality. A statement piece that celebrates beauty, presence, and empowerment.\n\n Mixed Media on Canvas 35.4×47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "PAb6WTZivgTXgT8YYkOx",
    "title": "Yellow Rose",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "yellow-rose",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%95%D7%A8%D7%93-%D7%A6%D7%94%D7%95%D7%91-100_80-2-scaled.webp",
    "search_blob": "Yellow Rose Merav Salman Modern Portraits This expressive artwork captures a woman's intense gaze in grayscale, her features bold and striking against a monochromatic background. One eye is covered by a vivid yellow rose — the only element in color — symbolizing hope, beauty, and vitality amidst the shades of black and white. The drips and abstract strokes add depth and emotion, emphasizing the contrast between life's struggles and moments of light. The rose becomes a beacon of optimism in an otherwise somber palette. Mixed Media on Canvas 31.5×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "tDjSoLN3pom0YIvSmIdN",
    "title": "Partnership In Dance",
    "artist": "Merav Salman",
    "price": 7200.0,
    "slug": "partnership-in-dance",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-65-scaled.webp",
    "search_blob": "Partnership In Dance Merav Salman Modern Portraits This captivating painting portrays a couple mid-motion in a graceful and powerful dance. Rendered in black and white, their bodies intertwine with elegance and strength, highlighting the unity and passion between them. Surrounding them is a lively backdrop filled with splashes of color and geometric shapes, adding vibrancy and movement that contrast with the monochromatic figures. It symbolizes how love and trust create harmony in motion - each partner supporting and elevating the other. Mixed Media on Canvas 59.1x59.1 in 2025.0 Sold Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "zE6N4bKRZ0108nOHT0wl",
    "title": "A Mind Full Of Ideas",
    "artist": "Merav Salman",
    "price": 4500.0,
    "slug": "a-mind-full-of-ideas",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-33-scaled.webp",
    "search_blob": "A Mind Full Of Ideas Merav Salman Modern Portraits This striking painting captures a grayscale portrait of a thoughtful woman with intense, expressive eyes. Her hair bursts into an abstract explosion of bold brushstrokes in vivid blues, black, white, and earthy ochre—symbolizing the powerful energy of creative thought. The contrast between the realistic face and dynamic abstract hair suggests a mind overflowing with imagination and vision.\n\n Mixed Media on Canvas 39.4×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "HYaG8P1RV26ygxDT14oI",
    "title": "Alone From Behind",
    "artist": "Merav Salman",
    "price": 4500.0,
    "slug": "alone-from-behind",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%94%D7%A4%D7%95%D7%9A-120_90-2-scaled.webp",
    "search_blob": "Alone From Behind Merav Salman Modern Portraits This expressive figurative painting features a woman seen from behind, her bare back and graceful posture rendered in grayscale, standing in poignant contrast to the vivid and dynamic background. The riot of pinks, reds, blues, and yellows creates an emotional, almost dreamlike atmosphere filled with abstract forms and symbols - hearts, spirals, and textures - that evoke passion, memory, and solitude. Her turned-away gaze and the softness of her pose capture a quiet moment of reflection, vulnerability, and inner strength. Mixed Media on Canvas 47.2×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "tJSjCyx7w93v0mPAHznM",
    "title": "Hair",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "hair",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/hair-scaled.jpeg",
    "search_blob": "Hair Merav Salman Modern Portraits A powerful figurative painting portraying a woman in monochrome tones, with a bold and confident gaze. Her wild, expressive hair bursts outward in vibrant splashes of red, orange, yellow, blue, and green against a calm turquoise background. The striking contrast between the grayscale figure and the explosive color symbolizes freedom, strength, and self-expression. This piece captures the energy and movement of a liberated spirit, celebrating femininity and individuality through dynamic brushwork and bold color.\n\n Mixed Media on Canvas 35.4x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "EkdVvDG5ed9Cbr0jAQ6O",
    "title": "Tommy Smoking",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "tommy-smoking",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-2023-02-18T044318.520-scaled.webp",
    "search_blob": "Tommy Smoking Merav Salman Modern Portraits A striking grayscale portrait inspired by Thomas Shelby from Peaky Blinders. The painting captures the intensity and calm menace of Tommy's character through sharp contrasts and focused expression, with a cigarette resting between his lips. A tribute to one of television's most iconic anti-heroes.\n\n Mixed Media on Canvas  31.5x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "6fybaXc3oKY68I5O3WGC",
    "title": "Classic In Red And Black",
    "artist": "Merav Salman",
    "price": 4700.0,
    "slug": "classic-in-red-and-black",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%9E%D7%97%D7%9B%D7%94-120_90-2-scaled.webp",
    "search_blob": "Classic In Red And Black Merav Salman Modern Portraits A bold and stylish silhouette of a woman captured in shades of red and black. Classic in Red and Black blends elegance, mystery, and modern femininity. The flowing dress, sleek hairstyle, and trailing cigarette smoke all evoke vintage allure with a contemporary twist.\n\n Mixed Media on Canvas 35.4×47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "0NTx9k9VrL3KWgXimS10",
    "title": "Play Of Light And Shadow",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "play-of-light-and-shadow",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%A9%D7%97%D7%95%D7%A8-%D7%9C%D7%91%D7%9F-120_90-2-scaled.webp",
    "search_blob": "Play Of Light And Shadow Merav Salman Modern Portraits A mesmerizing portrait that captures the delicate balance between exposure and concealment. Play of Light and Shadow explores duality through striking black-and-white contrast - half of the face illuminated, half cloaked in mystery. This minimalist yet powerful composition evokes introspection and the complexity of identity.\n Mixed Media on Canvas 35.4×47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "iD2iFPgvQ3PCFuHVDdrJ",
    "title": "As Beautiful As You Are Naomi",
    "artist": "Merav Salman",
    "price": 4500.0,
    "slug": "as-beautiful-as-you-are-naomi",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%A0%D7%A2%D7%9E%D7%94-120_100-2-scaled.webp",
    "search_blob": "As Beautiful As You Are Naomi Merav Salman Modern Portraits A striking fusion of monochrome elegance and expressive color, this portrait of Naomi radiates strength and beauty. Bold brushstrokes and vivid splashes contrast her calm, commanding presence - celebrating both outer beauty and inner power.\n\n Mixed Media on Canvas  35.4×47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "pXwQ9PmVPhULwNDJcbOH",
    "title": "Girl In High Socks",
    "artist": "Merav Salman",
    "price": 4500.0,
    "slug": "girl-in-high-socks",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%A6%D7%94%D7%95%D7%91-90_120-2-scaled.webp",
    "search_blob": "Girl In High Socks Merav Salman Modern Portraits \"Girl in High Socks\" is a bold and expressive portrait that blends playful style with emotional depth. The subject sits introspectively against a vibrant yellow background, her colorful, voluminous hair cascading in abstract bursts of color. The crisp white knee-high socks with red stripes add a sporty touch to this striking fusion of realism and vibrant imagination.\n\n Mixed Media on Canvas 35.4×47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "DVuizFdu8RZXKUzIbNEi",
    "title": "Your Life In Color",
    "artist": "Merav Salman",
    "price": 4300.0,
    "slug": "your-life-in-color",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-35-scaled.webp",
    "search_blob": "Your Life In Color Merav Salman Modern Portraits \"Your Life in Color\" bursts with joy, energy, and fearless self-expression. The figure’s wide, genuine smile and dynamic, flowing hair radiate movement and positivity - painted in bold, expressive strokes and vibrant hues. This artwork celebrates the beauty of living fully, loudly, and unapologetically in your own colors.\n\n Mixed Media on Canvas 39.4×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "vrMrrpH8SV9IXq9o0Upb",
    "title": "All The Power In Your Hair",
    "artist": "Merav Salman",
    "price": 4500.0,
    "slug": "all-the-power-in-your-hair",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-38-scaled.webp",
    "search_blob": "All The Power In Your Hair Merav Salman Modern Portraits \"All the Power in Your Hair\" is a bold and empowering portrait that honors strength, identity, and self-expression. The grayscale face and body provide a striking contrast to the vibrant, explosive afro made of multicolored splatters - symbolizing creativity, culture, and unapologetic beauty. A powerful visual statement of pride and individuality.\n\n Mixed Media on Canvas 39.4×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "tZrikZNtjRZFcKOpNDeh",
    "title": "Candy Puffs",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "candy-puffs",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/100X100.webp",
    "search_blob": "Candy Puffs Merav Salman Modern Portraits \"Candy Puffs\" is a playful and bold portrait that celebrates fun, confidence, and individuality. The subject's tightly styled twin buns burst into spheres of vibrant, candy-like color against a deep black background - creating a striking visual contrast. Her confident gaze and bright pink top add to the sense of youthful power and stylish charm.\n\n Mixed Media on Canvas 39.4×39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "7T5BtSkMmLQno9ns6aPM",
    "title": "Colorful",
    "artist": "Merav Salman",
    "price": 4300.0,
    "slug": "colorful",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/06/colorful-scaled.jpg",
    "search_blob": "Colorful Merav Salman Modern Portraits \"Colorful\" is a radiant and expressive portrait that celebrates bold identity and vibrant beauty. Set against a deep black background, the figure’s calm gaze contrasts with the explosion of multicolored splashes that form her hair - creating a dazzling aura of creativity, individuality, and inner strength. A striking blend of realism and abstract energy.\n\n Mixed Media on Canvas 31.5x31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "PaSK42XiewgJ41axq7Xl",
    "title": "Fire And Flame",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "fire-and-flame",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-9-scaled.webp",
    "search_blob": "Fire And Flame Merav Salman Modern Portraits \"Fire and Flame\" is a bold celebration of passion, freedom, and self-expression. With her head tilted back and eyes closed in ecstasy, the subject radiates energy as her hair erupts into a dramatic explosion of fiery reds, yellows, and electric colors. This striking portrait captures a moment of emotional release - where inner fire meets artistic expression in full force.\n\n Mixed Media on Canvas 31.5x31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "e4xxh66kOyuYvI63Gs6T",
    "title": "Sweet Kiss",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "sweet-kiss",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/06/sweet-kiss-scaled.jpg",
    "search_blob": "Sweet Kiss Merav Salman Modern Portraits \"Sweet Kiss\" is a poetic and imaginative portrait that radiates warmth and wonder. A serene female figure gently extends her hand, ready to release a kiss into the air, while her hair bursts into a stunning explosion of multicolored splatters - symbolizing thought, emotion, and vibrant energy. The soft aqua background enhances the dreamy, expressive atmosphere of this captivating piece.\n Mixed Media on Canvas 31.5x31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "c1LBoxcVpcewSYx85tDh",
    "title": "Anisa Against A Blue Sky",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "anisa-against-a-blue-sky",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-8-scaled.webp",
    "search_blob": "Anisa Against A Blue Sky Merav Salman Modern Portraits \"Anisa Against a Blue Sky\" is a striking portrait of elegance and quiet strength. Set against a textured sky-blue background with expressive brushwork, Anisa's composed gaze and flowing black hair exude poise and confidence. The bold red tones of her clothing add contrast and intensity, enhancing the emotional resonance of this modern figurative piece.\n\n Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "RzJ5NalS001oc4BMeVeM",
    "title": "Promise Not to Tell",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "promise-not-to-tell",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-70-scaled.webp",
    "search_blob": "Promise Not to Tell Merav Salman Modern Portraits \"Promise Not to Tell?\" captures a moment of intrigue and intimacy. With piercing blue eyes, bold red lips, and a finger held to her mouth, the subject invites the viewer into a secret. Splashes of yellow and abstract textures layer the portrait with mystery, emotion, and playful rebellion -blending realism with expressive abstraction.\n Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "CM9KP73QUydl27zE4oEr",
    "title": "Adriana Colorful Hair With White Ribbon",
    "artist": "Merav Salman",
    "price": 4150.0,
    "slug": "adriana-colorful-hair-with-white-ribbon",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-57-scaled.webp",
    "search_blob": "Adriana Colorful Hair With White Ribbon Merav Salman Modern Portraits \"Adriana Colorful Hair With White Ribbon\" is a radiant portrait celebrating individuality and cultural beauty. The calm profile of Adriana, wrapped in a white headscarf and adorned with bold golden hoops, contrasts strikingly with the explosion of colorful splashes symbolizing vibrant thoughts, expression, and creative identity. Mixed Media on Canvas 31.5x31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "zX1B2S8kHYQg41M6FBk6",
    "title": "Girl With Colorful Curls",
    "artist": "Merav Salman",
    "price": 4250.0,
    "slug": "girl-with-colorful-curls",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-58-scaled.webp",
    "search_blob": "Girl With Colorful Curls Merav Salman Modern Portraits \"Girl with Colorful Curls\" is a striking portrait that blends grayscale realism with bursts of vivid expression. The subject’s calm, introspective gaze contrasts beautifully with her vibrant, multicolored curls—symbolizing individuality, inner depth, and the joyful complexity of identity.\n\n Canvas 39.4x39.4 in Available Square"
  },
  {
    "art_id": "VNwfnH4OfqOd0YYcWT6W",
    "title": "Gordon Pool",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "gordon-pool",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-69-scaled.webp",
    "search_blob": "Gordon Pool Merav Salman Modern Portraits \"Gordon Pool\" is a vibrant and confident portrait that captures the essence of summer and seaside cool. The oversized sunglasses reflect a serene ocean view, while the upward angle and bold colors give the subject a powerful, larger-than-life presence. A modern pop-inspired celebration of sun, style, and attitude.\n Mixed Media on Canvas 31.5x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "GT6vrfk9xjVM7lxFU5YM",
    "title": "Noise In The Sky",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "noise-in-the-sky",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-30-scaled.webp",
    "search_blob": "Noise In The Sky Merav Salman Abstract Art A Storm is Coming delivers an electrifying rush of movement and emotion. This bold abstract composition channels the energy of nature and the chaos of the human spirit through sweeping strokes, vivid colors, and fearless texture. Designed in a horizontal format, it invites the viewer into the eye of the storm.\n Mixed Media on Canvas 39.4x51.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "qAmq6K4huotGJ8thND8p",
    "title": "A Storm Is Coming",
    "artist": "Merav Salman",
    "price": 4150.0,
    "slug": "a-storm-is-coming",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-2023-02-17T230810.209-scaled.webp",
    "search_blob": "A Storm Is Coming Merav Salman Abstract Art A Storm is Coming delivers an electrifying rush of movement and emotion. This bold abstract composition channels the energy of nature and the chaos of the human spirit through sweeping strokes, vivid colors, and fearless texture. Designed in a horizontal format, it invites the viewer into the eye of the storm.\n\n Mixed Media on Canvas 47.2×35.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "bX4ba1E2G8661P2965Wb",
    "title": "Winds Of Hope",
    "artist": "Merav Salman",
    "price": 5700.0,
    "slug": "winds-of-hope",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/spirits-of-hope-scaled.jpg",
    "search_blob": "Winds Of Hope Merav Salman Abstract Art A dynamic abstract composition evoking the motion and momentum of wind. \"Winds of Hope\" radiates energy and optimism through bold strokes, fluid layers, and vibrant color contrasts - capturing the feeling of rising above and moving forward Mixed Media on Canvas 63x31.5 in  2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "g7dE2lOHosBcm8wPSKeS",
    "title": "Classic Lady",
    "artist": "Merav Salman",
    "price": 5100.0,
    "slug": "classic-lady",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/04/classic-lady-scaled.jpg",
    "search_blob": "Classic Lady Merav Salman Modern Portraits \"Classic Lady\" is a tribute to timeless elegance. With bold lines, vivid yellow backdrop, and a confident pose, this striking portrait captures the essence of feminine grace, fashion, and allure in contemporary figurative style.\n\n Mixed Media on Canvas 35.4x51.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "YlTuvK73bigQyoTVcNgP",
    "title": "Going With The Flow",
    "artist": "Merav Salman",
    "price": 4800.0,
    "slug": "going-with-the-flow",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%A1%D7%A0%D7%93%D7%A8%D7%94-120_100-2-scaled.webp",
    "search_blob": "Going With The Flow Merav Salman Modern Portraits A vibrant fusion of portraiture and abstraction. \"Going with the Flow\" captures the essence of freedom and fluid identity, as a mysterious figure dissolves into bold strokes of color—blurring the line between control and spontaneity. Mixed Media on Canvas 39.4x51.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "mh9XJwadyi4Z9ylUUz8Z",
    "title": "The White Lion",
    "artist": "Merav Salman",
    "price": 4600.0,
    "slug": "the-white-lion",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/am-yisrael-chai.jpg",
    "search_blob": "The White Lion Merav Salman Modern Portraits A majestic fusion of power and elegance. \"The White Lion\" portrays regal strength through an anthropomorphic lion dressed in a formal white suit, exuding confidence and command. A bold symbol of nobility, control, and refined wildness. Mixed Media on Canvas 35.4x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "hYT56xfmx5HpVn7F0L3R",
    "title": "Pink Panther",
    "artist": "Merav Salman",
    "price": 4150.0,
    "slug": "pink-panther",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/pink-panther.jpeg",
    "search_blob": "Pink Panther Merav Salman Modern Portraits A playful and stylish fusion of fashion and fantasy. \"Pink Panther\" blends animal instinct with human attitude, showcasing a bold leopard figure in chic pink attire. A statement piece full of character, humor, and visual flair. Mixed Media on Canvas 35.4x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "TgI1maMli7g1z187p14d",
    "title": "Seeing In Gold",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "seeing-in-gold",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/sees-gold-scaled.jpeg",
    "search_blob": "Seeing In Gold Merav Salman Modern Portraits A striking figurative portrait that explores perception and inner value. \"Seeing In Gold\" blends grayscale realism with radiant gold leaf, symbolizing contrast between external form and internal brilliance.\n Mixed Media on Canvas 35.4x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "AheoQIodXicJAflTQrcE",
    "title": "Rabbi Menachem Mendel Schneerson Zatzal",
    "artist": "Merav Salman",
    "price": 5200.0,
    "slug": "rabbi-menachem-mendel-schneerson-zatzal",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/09/rabi-milobavitch-green-bg.jpeg",
    "search_blob": "Rabbi Menachem Mendel Schneerson Zatzal Merav Salman Judaica Art A reverent portrait of Rabbi Menachem Mendel Schneerson Zatzal, the Lubavitcher Rebbe, whose wisdom and spiritual leadership continue to inspire generations. The painting captures his piercing gaze and noble presence, set against a calming teal background that highlights both dignity and serenity.\n Mixed Media on Canvas 39.4x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "1VjeMzmlYFk5DDsoexBA",
    "title": "Rabbi Ovadia Yosef Zatzal",
    "artist": "Merav Salman",
    "price": 5200.0,
    "slug": "rabbi-ovadia-yosef-zatzal",
    "main_image": "https://meravsalman.com/wp-content/uploads/2024/10/rabbi-ovadia-yosef.jpg",
    "search_blob": "Rabbi Ovadia Yosef Zatzal Merav Salman Judaica Art A dignified portrait honoring Rabbi Ovadia Yosef Zatzal, one of the most influential Sephardic sages of modern times. The artwork captures his warmth, wisdom, and spiritual leadership, framed in golden tones that reflect his enduring legacy.\n Mixed Media on Canvas 35.4x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "vxH6xuFMnoyeeMoxb9OY",
    "title": "Dana Tilting Her Head",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "dana-tilting-her-head",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-15-scaled.webp",
    "search_blob": "Dana Tilting Her Head Merav Salman Modern Portraits An intimate and emotional portrait capturing quiet introspection. \"Dana Tilting Her Head\" merges grayscale realism with a vivid abstract backdrop, creating a striking contrast between inner emotion and external chaos. Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "Bz5UAtSdg956NpW3bJhP",
    "title": "Woman Peeking From Under A Giant Hat",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "woman-peeking-from-under-a-giant-hat",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/04/woman-peeps-scaled.jpg",
    "search_blob": "Woman Peeking From Under A Giant Hat Merav Salman Modern Portraits A chic and mysterious portrait blending monochrome elegance with abstract vibrancy. \"Woman Peeking from Under a Giant Hat\" captures bold femininity and modern allure through striking contrast and poised composition. Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "SzJL5AIlOVKFTIHlHQkf",
    "title": "Diana Afro",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "diana-afro",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/04/dianas-afro-scaled.jpg",
    "search_blob": "Diana Afro Merav Salman Modern Portraits A bold and confident portrait that merges monochrome elegance with vibrant street art. \"Diana Afro\" celebrates individuality, strength, and cultural identity through expressive figurative style. Mixed Media on Canvas 23.6x23.6 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "VoNqaAqayjm3irsi4mnD",
    "title": "The Beautiful Life Of Eden",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "the-beautiful-life-of-eden",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%A2%D7%93%D7%99-100_100-2-1019x1024.webp",
    "search_blob": "The Beautiful Life Of Eden Merav Salman Modern Portraits A vivid and expressive portrait that celebrates feminine emotion and identity. \"The Beautiful Life of Eden\" features a striking face with bold, colorful brushstrokes layered across the skin, conveying both vulnerability and strength. The intense gaze, detailed hands, and textured hair reflect a deep inner world—captured through a modern figurative lens. Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "iKGt4IjEOCBENz4sQy0M",
    "title": "Emily In South Tel Aviv",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "emily-in-south-tel-aviv",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%90%D7%9E%D7%99%D7%9C%D7%99-100_100-3-150x150.webp",
    "search_blob": "Emily In South Tel Aviv Merav Salman Modern Portraits A bold modern portrait combining monochrome realism with a striking yellow background. The anonymous figure—with braided hair, a cigarette in her mouth, and a hat pulled over her eyes—evokes a sense of urban defiance, personal freedom, and cultural edge. This piece captures raw feminine power against the backdrop of contemporary city life.\n\n Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "3MGpq7HzAQpnVBkfhMEy",
    "title": "Dan Life",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "dan-life",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-13-scaled.webp",
    "search_blob": "Dan Life Merav Salman Modern Portraits A captivating monochrome portrait set against a vivid abstract backdrop. The contrast between the grayscale figure and the vibrant bursts of color reflects inner strength, quiet thought, and the complex beauty of a life fully lived. Mixed Media on Canvas 23.6x23.6 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "xXYstXOudShXahU0kcQa",
    "title": "Roni Looking Over Her Shoulder",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "roni-looking-over-her-shoulder",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%A8%D7%95%D7%A0%D7%99-80_80-2-scaled.webp",
    "search_blob": "Roni Looking Over Her Shoulder Merav Salman Modern Portraits A striking portrait of quiet strength and elegance. With a piercing gaze and vivid mosaic-like brushwork, Roni emerges from a deep black background, radiating presence, mystery, and feminine confidence. Mixed Media on Canvas 31.5x31.5 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "yIEByrCeSPUXEOAyVONC",
    "title": "Life In Purple And Gold",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "life-in-purple-and-gold",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/130x90.webp",
    "search_blob": "Life In Purple And Gold Merav Salman Modern Portraits A bold and stylish portrait celebrating individuality and flair. With oversized pink sunglasses, vibrant magenta hair, and a golden patterned backdrop, this artwork radiates confidence, elegance, and pop-culture sophistication. Mixed Media on Canvas 35.4x51.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "0Jkidcxn7rQIgtJOG4cT",
    "title": "Eden In A Mirror Image",
    "artist": "Merav Salman",
    "price": 4900.0,
    "slug": "eden-in-a-mirror-image",
    "main_image": "https://bayagallery.com/cdn/eden/main.png",
    "search_blob": "Eden In A Mirror Image Merav Salman Modern Portraits This striking portrait explores identity and perception through a mirrored composition and bold color strokes. With only half her face revealed, Eden invites the viewer into a quiet moment of introspection, blending raw beauty with expressive abstraction. Mixed Media on Canvas 19.7x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "vhgVlh58WDYcgfWA8EYC",
    "title": "Rising Smoke Sparks",
    "artist": "Merav Salman",
    "price": 5500.0,
    "slug": "rising-smoke-sparks",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%90%D7%93%D7%95%D7%9D-%D7%91%D7%A2%D7%99%D7%A0%D7%99%D7%99%D7%9D-120_100-2-scaled.webp",
    "search_blob": "Rising Smoke Sparks Merav Salman Modern Portraits A provocative and modern portrait, Rising Smoke Sparks captures raw intensity and bold self-expression. The subject’s piercing gaze and vivid facial accents contrast with the drifting smoke, evoking a mood that’s both rebellious and magnetic.\n Mixed Media on Canvas 47.2x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "hlY0sqHZgX0GPwLxsi8a",
    "title": "Adriana",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "adriana",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%90%D7%93%D7%A8%D7%99%D7%90%D7%A0%D7%94-120_90-2-scaled.webp",
    "search_blob": "Adriana Merav Salman Modern Portraits A bold and captivating portrait, Adriana draws the viewer in with piercing eyes and a vivid tapestry of colors. The expressive brushwork and striking contrasts celebrate individuality, emotion, and the modern feminine spirit. Mixed Media on Canvas 35.4x47.2 in 2025.0 Sold Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "fKGkG0FY4s6mtCQUs07V",
    "title": "Dance In Vivid Colors",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "dance-in-vivid-colors",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%A8%D7%95%D7%A7%D7%93%D7%99%D7%9D-%D7%95%D7%A0%D7%94%D7%A0%D7%99%D7%9D-100_100-2-scaled.webp",
    "search_blob": "Dance In Vivid Colors Merav Salman Modern Portraits An exhilarating celebration of movement and emotion, this painting captures two dancers in perfect harmony, surrounded by explosive splashes of color. A powerful blend of form and freedom, it radiates vitality, rhythm, and expressive joy. Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "qjTOqcGOctZZGiywUXrr",
    "title": "Sarah In The Streets",
    "artist": "Merav Salman",
    "price": 5100.0,
    "slug": "sarah-in-the-streets",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/120x90.webp",
    "search_blob": "Sarah In The Streets Merav Salman Modern Portraits A bold and electrifying portrait of feminine freedom and confidence. With her wild hair, expressive pose, and golden backdrop, Sarah becomes a symbol of unrestrained emotion and vibrant self-expression on canvas. Mixed Media on Canvas 35.4x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "e3rqdsR1HIRiK7uNPZFl",
    "title": "Curly Haired Boy In Thought",
    "artist": "Merav Salman",
    "price": 4100.0,
    "slug": "curly-haired-boy-in-thought",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%97%D7%95%D7%A9%D7%91-120_90-2-scaled.webp",
    "search_blob": "Curly Haired Boy In Thought Merav Salman Modern Portraits This striking canvas captures a contemplative young man with expressive green eyes and bold, multicolored brushwork. The fusion of vivid hues with sculptural form evokes depth and introspection, making the piece both modern and emotionally resonant. Mixed Media on Canvas 35.4x47.2 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "ZFESF5pl0yrA1KHK1ftF",
    "title": "A Smile That Lights My Day",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "a-smile-that-lights-my-day",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/pantings-24-scaled.webp",
    "search_blob": "A Smile That Lights My Day Merav Salman Modern Portraits A radiant portrayal of joy and warmth, this piece captures the essence of a smile that brightens the world around it. The vibrant colors and dynamic brushstrokes celebrate the uplifting power of happiness and human connection.\n\n Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "Vnwb4kbb6scEMqAhhPdw",
    "title": "You And Me Colorful Love",
    "artist": "Merav Salman",
    "price": 5500.0,
    "slug": "you-and-me-colorful-love",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/02/%D7%96%D7%95%D7%92-150-_120-1-1536x1112.webp",
    "search_blob": "You And Me Colorful Love Merav Salman Modern Portraits A vibrant and intimate portrayal of connection, this piece captures the essence of “You and Me” in a dynamic fusion of colors. The bold brushstrokes and vivid palette evoke the complexity and beauty of a shared bond, celebrating unity and emotional depth. Mixed Media on Canvas 47.2x63.0 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "tr3taLwA5EMjgCe62tkE",
    "title": "Optimism",
    "artist": "Merav Salman",
    "price": 4200.0,
    "slug": "optimism",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/03/04911bb9-735c-4669-a2fa-8fb9b4704915.webp",
    "search_blob": "Optimism Merav Salman Modern Portraits This vibrant portrait captures a joyful woman with striking black curls and radiant colors. Accented by golden hoops and a magenta top, she exudes energy and optimism. Subtle words in the background underscore the artwork’s uplifting spirit and celebration of life.\n\n Mixed Media on Canvas 39.4x39.4 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  },
  {
    "art_id": "rOlBLi1P98fZ1TLxUo0U",
    "title": "Jennifer Coolidge",
    "artist": "Merav Salman",
    "price": 4250.0,
    "slug": "jennifer-coolidge",
    "main_image": "https://meravsalman.com/wp-content/uploads/2023/03/pantings-2023-03-04T202615.007-scaled.webp",
    "search_blob": "Jennifer Coolidge Merav Salman Modern Portraits A vibrant and contemporary portrait capturing the charismatic essence of Jennifer Coolidge. This canvas blends bold colors and modern design to create a striking visual tribute to an iconic figure, celebrating personality through artistic expression. Mixed Media on Canvas 23.6x23.6 in 2025.0 Available Square Masterpiece by renowned Israeli artist, Unique piece - never to be replicated, Hand-signed by the artist, Certificate of authenticity included"
  }
]